music_app/app/views/albums/edit.html.erb

          <option disabled>--Select Band--</option>
          <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"