music_app/app/views/albums/new.html.erb

SELECT "bands".* FROM "bands"
---
          <option disabled selected>--Select Band--</option>
          <% Band.all.each do |band| %>