music_app/app/controllers/albums_controller.rb

  def create
    @album = Album.new(album_params)
    @album.band_id = params[:album][:band_id]

    if @album.save
---
INSERT INTO "albums" ("band_id", "title", "year", "live?", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["band_id", 5], ["title", "Sgt Peppers"], ["year", 1965], ["live?", "false"], ["created_at", "2022-03-15 20:06:50.846956"], ["updated_at", "2022-03-15 20:06:50.846956"]]

  def update
    @album = Album.find(params[:id])

    if @album.update(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "albums" SET "year" = $1, "live?" = $2, "updated_at" = $3 WHERE "albums"."id" = $4  [["year", 1967], ["live?", "true"], ["updated_at", "2022-03-15 20:37:26.267883"], ["id", 2]]

  def destroy
    @album = Album.find(params[:id])
    @album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 1]]