music_app/app/controllers/tracks_controller.rb

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def new
    @album = Album.find(params[:album_id])

INSERT INTO "tracks" ("album_id", "title", "ord", "lyrics", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["album_id", 2], ["title", "A Day in the Life"], ["ord", 1], ["lyrics", "A day in the life"], ["created_at", "2022-03-15 21:08:34.022693"], ["updated_at", "2022-03-15 21:08:34.022693"]]
---
  def create
    @track = Track.new(track_params)
    @track.album_id = params[:track][:album_id]

    if @track.save

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @track = Track.find(params[:id])

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "tracks" SET "lyrics" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3
---
  def update
    @track = Track.find(params[:id])

    if @track.update(track_params)

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 1]]
---
  def destroy
    @track = Track.find(params[:id])
    @track.destroy