music_app/app/views/tracks/edit.html.erb

          <option disabled selected>--Select Album--</option>
          <% Album.all.each do |album| %>
---
SELECT "albums".* FROM "albums"