music_app/app/views/tracks/new.html.erb

SELECT "albums".* FROM "albums"
---
          <option disabled selected>--Select Album--</option>
          <% Album.all.each do |album| %>